{
    "ECLI:EU:C:1979:42_14": "",
    "ECLI:EU:C:1984:153_23": "Si une application complète de la directive n'impose pas, ainsi qu'il a été constaté dans la réponse à la première question, une forme déterminée de sanction en cas de violation de l'interdiction de discrimination, elle implique néanmoins que cette sanction soit de nature à assurer une protection juridictionnelle effective et efficace. Elle doit en outre avoir à l'égard de l'employeur un effet dissuasif réel. Il en résulte que lorsque l'État membre choisit de sanctionner la violation de l'interdiction de discrimination par l'octroi d'une indemnité, celle-ci doit être en tout cas adéquate au préjudice subi.",
    "ECLI:EU:C:1990:383_23": "L' article 6 de la directive reconnaît dans le chef des victimes de discrimination l' existence de droits pouvant être invoqués en justice . Si une application complète de la directive n' impose pas une forme déterminée de sanction en cas de violation de l' interdiction de discrimination, elle implique, en revanche, que cette sanction soit de nature à assurer une protection juridictionnelle effective et efficace ( arrêt du 10 avril 1984, Von Colson et Kamann, point 23, 14/83, Rec . p . 1891 ). Elle doit, en outre, avoir à l' égard de l' employeur un effet dissuasif réel .",
    "ECLI:EU:C:1991:152_11": "C' est, notamment, en raison de cette difficulté que doit être reconnue aux institutions communautaires compétentes, comme l' a, d' ailleurs, déjà jugé la Cour à propos de directives d' harmonisation prises sur le fondement d' autres dispositions du traité ( arrêt du 29 février 1984, Rewe-Zentrale, point 20, 37/83, Rec . p . 1229 ), une marge d' appréciation sur les étapes à observer dans l' harmonisation, compte tenu des spécificités de la matière soumise à coordination .",
    "ECLI:EU:C:1993:335_24": "Toutefois, l' objectif est de parvenir à une égalité de chances effective et ne saurait dès lors être atteint en l' absence de mesures propres à rétablir cette égalité lorsqu' elle n' est pas respectée. Comme la Cour l' a précisé dans l' arrêt von Colson et Kamann, précité, point 23, ces mesures doivent assurer une protection juridictionnelle effective et efficace et avoir à l' égard de l' employeur un effet dissuasif réel.",
    "ECLI:EU:C:1997:208_25": "Par ailleurs, la directive implique que, si un État membre choisit de sanctionner la violation de l'interdiction d'une discrimination par l'octroi d'une indemnité, celle-ci doit être de nature à assurer une protection juridictionnelle effective et efficace, doit avoir un effet dissuasif réel à l'égard de l'employeur et doit être en tout cas adéquate au préjudice subi. Une indemnisation purement symbolique ne saurait être conforme aux exigences d'une transposition efficace de la directive (arrêt Von Colson et Kamann, précité, points 23 et 24).",
    "ECLI:EU:C:1997:208_27": "En effet, ainsi que la Cour l'a précisé dans l'arrêt Von Colson et Kamann, précité, point 23, dès lors que les États membres choisissent de réparer les dommages subis en raison d'une discrimination interdite par la directive dans le cadre d'un régime de responsabilité civile de l'employeur, cette réparation doit être adéquate au préjudice subi.",
    "ECLI:EU:C:1997:208_39": "Ainsi que la Cour l'a précisé dans l'arrêt Von Colson et Kamann, précité, point 23, la directive implique que la sanction choisie par les États membres doit avoir un effet dissuasif réel à l'égard de l'employeur et doit être adéquate par rapport aux préjudices subis, afin d'assurer une protection juridictionnelle effective et efficace.",
    "ECLI:EU:C:1998:192_99": "Or, il doit être admis que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, les institutions peuvent prendre des mesures de protection sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées.",
    "ECLI:EU:C:1998:359_134": "Étant donné que le litige dans la procédure au principal concerne l'interprétation de la directive 76/207, et non celle de l'article 119 du traité, nous ne pensons pas qu'il soit nécessaire de répondre à la première question. Conformément à la solution que nous avons proposée, il faudra, parmi les éléments d'une mesure nationale telle que la mesure litigieuse, distinguer entre ceux qui intéressent directement le droit communautaire et ceux qui ne l'intéressent pas directement (du moins, à l'heure actuelle). Nous avons aussi estimé que, dès lors que la mesure est contraire à la directive 76/207 pour des raisons fondamentales et indépendantes du sexe du travailleur affecté, il est inutile d'examiner si, eu égard à des éléments qui nous paraissent insuffisants et faibles, la mesure introduit une discrimination indirecte, en particulier contre les femmes. La solution que nous proposons a pour effet que la personne affectée peut obtenir une protection efficace dans le cadre du droit national, mais seulement dans des domaines couverts par la directive 76/207, c'est-à-dire seulement si son licenciement est fondé sur le sexe. En revanche, si c'est le point de vue des demanderesses et de la Commission qui l'emporte, après suppression de la disposition litigieuse, tout licenciement devra être examiné afin de déterminer s'il est abusif en général, même lorsqu'il n'est pas fondé sur le sexe. Or, cela sortirait du cadre et des buts de la directive 76/207. Eu égard à ce qui précède, nous proposons à la Cour de répondre dans les termes suivants aux questions posées à titre préjudiciel: (1) - JO L 39, p. 40. (2) - JO L 45, p. 19. (3) - Voir, notamment, l'arrêt du 31 mars 1981, Jenkins (96/80, Rec. p. 911, point 22). (4) - Des dispositions similaires figurent maintenant dans le chapitre X de l'Employment Rights Act 1996, articles 94 et suiv. (5) - SI 1985, n_ 782. (6) - Arrêt du 17 mai 1990 (C-262/88, Rec. p. I-1889). (7) - Arrêt du 27 juin 1990 (C-33/89, Rec. p. I-2591). (8) - Arrêts Barber (points 12 à 20) et Kowalska (points 9 à 11), précités dans la note 7. (9) - Arrêt du 15 juin 1978 (149/77, Rec. p. 1365). (10) - Arrêt précité dans la note 9. (11) - Points 19, 20 et 21. Voir également l'arrêt du 2 octobre 1997, Gerster (C-1/95, Rec. p. I-5253, points 21 et suiv.). (12) - Arrêt du 16 février 1982 (19/81, Rec. p. 555). (13) - Arrêt du 26 février 1986, Roberts (151/84, Rec. p. 703, points 30 à 32). (14) - Arrêt du 26 février 1986, Marshall I (152/84, Rec. p. 723, points 32 à 34). (15) - Arrêt du 30 avril 1996, P/S (C-13/94, Rec. p. I-2143, point 12). Notons que, dans cet arrêt, bien que le licenciement soit intervenu en décembre 1992, après un an et demi d'emploi, l'Industrial Tribunal, juridiction de renvoi, a examiné l'affaire au fond et s'est demandé si le licenciement constituait un traitement discriminatoire fondé sur le sexe, sans s'interroger sur une limitation dans le temps, comme il le fait dans la présente affaire. (16) - Voir, à titre d'exemple, l'arrêt Kowalska, précité dans la note 7 (point 20); les arrêts du 7 février 1991, Nimz (C-184/89, Rec. p. I-297, point 21); du 28 septembre 1994, Coloroll Pension Trustees (C-200/91, Rec. p. I-4389, point 29), et d'autres. (17) - Arrêt précité dans la note 16. (18) - Arrêt précité dans la note 11. (19) - Voir ci-après, point 118. (20) - Voir l'arrêt Defrenne III, précité dans la note 9 (point 19); les arrêts du 29 septembre 1987, Giménez Zaera (126/86, Rec. p. 3697, point 14); du 17 mars 1993, Sloman Neptun (C-72/91 et C-73/91, Rec. p. I-887, point 25), et autres. Ces articles ne sont toutefois pas totalement privés d'effets juridiques, mais ils constituent des éléments essentiels pour l'interprétation d'autres dispositions du traité et du droit communautaire dérivé dans le domaine social [voir les deux derniers arrêts (respectivement, points 14 et 26)]. (21) - Voir les arrêts Giménez Zaera (point 14) et Sloman Neptun (point 26), précités dans la note 20. Voir également les arrêts du 24 février 1994, Roks e.a. (C-343/92, Rec. p. I-571, point 28); du 14 décembre 1995, Nolte (C-317/93, Rec. p. I-4625, point 33), et Megner et Scheffel (C-444/93, Rec. p. I-4741, point 29), et du 1er février 1996, Posthuma-Van Damme et Oztürk (C-280/94, Rec. p. I-179, point 26). Certes, les États membres peuvent prendre de nouvelles mesures dans le cadre de leur politique sociale, même des mesures plus strictes que les mesures antérieures, à la condition qu'elles ne soient pas contraires au principe d'égalité de traitement (voir, à titre d'exemple, les arrêts du 19 octobre 1995, Richardson, C-137/94, Rec. p. I-3407, point 29, et Posthuma-Van Damme et Oztürk, point 29). Toutefois, il ne faudrait pas tomber dans l'excès inverse, de telle sorte que, par des dispositions communautaires à but spécial et restreint, la politique des États membres dans des secteurs dans lesquels la Communauté n'a pas encore voulu légiférer soit contrôlée et, éventuellement, renversée (voir les arrêts Defrenne III, précité dans la note 9, point 32; du 13 mai 1986, Bilka, 170/84, Rec. p. 1607, point 42, et d'autres). (22) - Voir l'arrêt du 8 avril 1976, Defrenne II (43/75, Rec. p. 455, point 63). De ce point de vue, en dépit des difficultés et de la complexité de la matière, nous observerons que la Communauté aurait pu régler globalement le problème des conditions de travail, eu égard à ses retombées évidentes sur l'achèvement du marché intérieur. (23) - Directive du Conseil du 17 février 1975, concernant le rapprochement des législations des États membres relatives aux licenciements collectifs (JO L 48, p. 29). (24) - Arrêts Marshall I (précité dans la note 14, points 52 et 55); du 12 juillet 1990, Foster e.a. (C-188/89, Rec. p. I-3313, point 21), et du 25 juillet 1991, Stoeckel (C-345/89, Rec. p. I-4047, point 12). En outre, l'article 5, paragraphe 1, peut être invoqué en vue d'obtenir des dommages-intérêts à l'encontre d'un organisme du secteur public pour violation de la directive (arrêt Foster e.a., point 22). Il ne peut toutefois pas être invoqué contre des employeurs privés, hormis l'État (arrêt Marshall I, point 48). (25) - A cet égard, elle est proche de la discrimination directe fondée sur le sexe. (26) - Voir l'arrêt du 22 avril 1997, Draehmpaehl (C-180/95, Rec. p. I-2195, point 24), qui concerne une indemnisation pour non-recrutement d'un candidat masculin en raison de son sexe. (27) - Voir ci-dessus, point 47. (28) - Notons en tout cas que le même représentant a exprimé son ignorance sur la question, qui lui avait été posée, de savoir s'il s'agira effectivement d'une conséquence en droit interne ou si, au contraire, plus aucun délai ne s'appliquerait. (29) - Bien qu'il n'existe aucune donnée concernant la taille des entreprises dans lesquelles les demanderesses ont travaillé, il faudra supposer qu'elles occupaient plus de vingt personnes. En effet, avant 1985, la période d'essai était de deux ans pour les travailleurs des petites entreprises (occupant moins de vingt personnes) et d'un an pour les travailleurs des grandes entreprises (occupant plus de vingt personnes - voir ci-dessus, point 18). Si les requérantes avaient travaillé dans une petite entreprise, elles ne contesteraient pas la réglementation de 1985, parce que sa mise à l'écart et la remise en vigueur du régime précédent ne leur seraient d'aucune utilité. (30) - Si la Cour adopte les points de vue des demanderesses, elle sera tôt ou tard amenée à devoir se prononcer sur la condition d'un an (sans parler du régime intermédiaire qui était en vigueur avant 1985 pour les travailleurs des petites et des grandes entreprises - voir ci-dessus, point 18), puis sur la condition de six mois, etc. Cela montre, à notre avis, l'impasse à laquelle conduit la tentative de tirer des conclusions, concernant la nature d'une mesure telle que la mesure litigieuse, de statistiques concernant ses éventuels effets. (31) - Voir l'arrêt du 15 mai 1986, Johnston (222/84, Rec. p. 1651, points 17 à 19). (32) - Voir les arrêts du 10 avril 1984, Von Colson et Kamann (14/83, Rec. p. 1891, points 18 et suiv.); du 8 novembre 1990, Dekker (C-177/88, Rec. p. I-3941, point 23); du 2 août 1993, Marshall II (C-271/91, Rec. p. I-4367, points 22 à 24); l'arrêt Draehmpaehl, précité dans la note 26, et d'autres. (33) - Arrêt précité dans la note 31 (point 21). (34) - Arrêt Marshall II, précité dans la note 32 (point 25). (35) - Voir les arrêts Von Colson et Kamann, précité dans la note 32 (point 22); du 21 mai 1985, Commission/Allemagne (248/83, Rec. p. 1459, point 10), et Marshall II, précité dans la note 32 (point 35). (36) - Voir, d'une manière générale, les arrêts du 19 juin 1990, Factortame e.a. (C-213/89, Rec. p. I-2433, points 18 et suiv.), et du 14 décembre 1995, Van Schijndel et Van Veen (C-430/93 et C-431/93, Rec. p. I-4705, point 18). Voir également l'arrêt du 6 juillet 1982, Commission/Royaume-Uni (61/81, Rec. p. 2601), qui concerne une transposition défectueuse du même article 6 de la directive 75/117. (37) - Les demanderesses craignent peut-être, si elles ne sont pas en mesure d'invoquer la directive à l'encontre de l'employeur, d'être obligées de demander réparation à l'État membre pour cause de transposition défectueuse de la directive, conformément à la jurisprudence Francovich I (arrêt du 19 novembre 1991, Francovich e.a., C-6/90 et C-9/90, Rec. p. I-5357). (38) - Arrêt du 5 mai 1994 (C-421/92, Rec. p. I-1657). (39) - Voir l'arrêt Dekker, précité dans la note 32 (point 10). (40) - Voir l'arrêt du 17 octobre 1989, Danfoss (109/88, Rec. p. 3199, point 11). (41) - Voir Anderman S. D.: The Law of Unfair Dismissal, 2e édition, Londres, Butterworths, 1985, (p. 17, note 17 iv) - sans qu'il renvoie de toute façon à des dispositions ou à une autre explication. Toutefois, d'autres auteurs ne disent rien de tel en ce qui concerne les exceptions à la règle des deux années (voir Sweet &amp; Maxwell: Encyclopedia of employment law, paragraphes 1-6103 et suiv.), mais ils examinent l'arrêt de la Court of Appeal dans la présente affaire dans le cadre de la discrimination indirecte fondée sur le sexe à la lumière du Sex Discrimination Act [ibidem, paragraphe 1-4003 (4)]. (42) - Voir l'arrêt du 16 décembre 1993, Wagner Miret (C-334/92, Rec. p. I-6911, points 20 et 21); l'arrêt Coloroll Pension Trustees, précité dans la note 16 (point 29), et d'autres. Nous avons examiné l'obligation de l'interprétation conforme au droit communautaire un peu plus en détail dans nos conclusions du 14 mai 1998 sous l'arrêt du 14 juillet 1998, Regeling (C-125/97, non encore publié au Recueil, points 33 à 35), auxquelles nous renvoyons afin d'éviter des redites. (43) - Voir les arrêts Roberts, précité dans la note 13 (point 36), et du 29 mai 1997, Larsson (C-400/95, Rec. p. I-2757, point 18). (44) - Voir l'arrêt Commission/Allemagne, précité dans la note 35 (point 22). (45) - Voir les arrêts du 2 octobre 1997, Kording (C-100/95, Rec. p. I-5289, point 14), et du 14 février 1995, Schumacker (C-279/93, Rec. p. I-225, point 30). (46) - Voir l'arrêt Kording, précité dans la note 45 (point 16). (47) - Arrêt du 27 mars 1980, Macarthys (129/79, Rec. p. 1275, point 15). L'identification des discriminations indirectes suppose quelquefois des études «même de l'économie globale» (arrêt Defrenne II, précité dans la note 22, point 19). (48) - Arrêt précité dans la note 3. (49) - Voir les arrêts Bilka, précité dans la note 21; du 13 juillet 1989, Rinner-Kühn (171/88, Rec. p. 2743); Kowalska, précité dans la note 7; du 6 février 1996, Lewark (C-457/93, Rec. p. I-243), et d'autres. (50) - Arrêt précité dans la note 11 (point 34, qui renvoie aux arrêts Bilka, Rinner-Kühn et Lewark). La Cour avait aussi déjà entre-temps repris cette jurisprudence dans le cadre de la directive 79/7/CEE du Conseil, du 19 décembre 1978, relative à la mise en oeuvre progressive du principe de l'égalité de traitement entre hommes et femmes en matière de sécurité sociale (JO 1979, L 6, p. 24) (voir l'arrêt du 7 mai 1991, Commission/Belgique, C-229/89, Rec. p. I-2205, point 13, avec référence à l'arrêt Kowalska), qui est aussi devenue depuis lors constante dans ce domaine (voir l'arrêt Roks e.a., précité dans la note 21). On peut donc parler d'un principe général qui sous-tend tout le droit social communautaire en matière d'égalité de traitement entre travailleurs masculins et travailleurs féminins. (51) - Voir, à titre d'exemple, l'arrêt Lewark, précité dans la note 49. (52) - Voir l'arrêt Danfoss, précité dans la note 40 (point 21). (53) - Voir l'arrêt du 15 décembre 1994, Helmig e.a. (C-399/92, C-409/92, C-425/92, C-34/93, C-50/93 et C-78/93, Rec. p. I-5727, points 23, 30 et 32). (54) - Arrêt Bilka, précité dans la note 21 (point 29). A notre avis, pour déterminer s'il existe une «différence sensible» de pourcentages dans la première catégorie, il faut aussi tenir compte de la composition de l'autre catégorie (avantagée). La catégorie avantagée devra présenter soit la tendance inverse, soit des pourcentages égaux, soit la même tendance mais beaucoup plus faible que dans la première catégorie. En effet, si la différence de pourcentages est identique ou comparable dans les deux catégories, les travailleurs des deux catégories subissent le même traitement, et non pas un traitement inégal (voir, immédiatement après, troisième et quatrième cas). (55) - Arrêt Rinner-Kühn, précité dans la note 49 (point 12). (56) - Arrêt précité dans la note 49 (point 11, en combinaison avec le point III, 2, du rapport d'audience et le point 31 des conclusions de l'avocat général M. Darmon). (57) - Arrêt précité dans la note 7 (point 13, en combinaison avec le point 3 des conclusions de l'avocat général M. Darmon). (58) - Arrêt précité dans la note 16 (point 12, en combinaison avec le point 2 du rapport d'audience). (59) - Arrêt du 27 octobre 1993 (C-127/92, Rec. p. I-5535, point 16, en combinaison avec le point 31 des conclusions de l'avocat général M. Lenz). (60) - Arrêt précité dans la note 45 (point 18). Rappelons que cet arrêt applique la directive 76/207. (61) - Arrêt du 17 juin 1998 (C-243/95, Rec. p. I-3739, point 25). (62) - Voir l'arrêt Enderby, précité dans la note 59 (point 14). (63) - Arrêts Rinner-Kühn, précité dans la note 49 (point 14), et Kording, précité dans la note 45 (point 26). (64) - Voir l'arrêt Helmig e.a., précité dans la note 53 (points 23 et 25). (65) - Notons que, s'il est vrai que le nombre de femmes qui sont de surcroît affectées, invoqué par les demanderesses dans leurs observations écrites et à l'audience, suscite la sympathie, il ne doit cependant pas être pris en considération. En effet, ce qui est déterminant en l'espèce, ce sont les proportions, et non les chiffres dans l'absolu, considérés en eux-mêmes. Pour rappeler Aristote: «Car rien, considéré en soi et pour soi, n'est dit grand ou petit, mais seulement par le fait d'être rapporté à une autre chose ... . Le grand ou le petit n'exprime pas une quantité, mais plutôt une relation, puisque c'est par rapport à une autre chose que l'on considère le grand et le petit. Il est ainsi manifeste que ces derniers termes sont aussi des relatifs» (Catégories, 5b 16-29); Aristote: Organon, traduction par J. Tricot, Vrin, Paris 1984, tome I, p. 25. (66) - Voir ci-dessus, point 86. (67) - Voir ci-dessus, points 113 et 114. (68) - Voir l'arrêt Enderby, précité dans la note 59 (point 17). (69) - Voir ci-dessus, point 116. (70) - Voir, à titre d'exemple, l'arrêt Lewark, précité dans la note 49 (point 36). (71) - Voir l'arrêt Nimz, précité dans la note 16 (point 14). (72) - Voir, à titre d'exemple, l'arrêt Kording, précité dans la note 45 (point 20).",
    "ECLI:EU:C:1998:424_27": "Toutefois, contrairement à ce que soutient ce même gouvernement, eu égard àl'objectif poursuivi par la directive, qui est de parvenir à une égalité des chanceseffective entre hommes et femmes (arrêt du 2 août 1993, Marshall, précité, point24), et au caractère fondamental du droit à une protection juridictionnelle effective, on ne saurait, en l'absence d'une indication claire en sens contraire, déduire del'article 7 de la directive l'intention du législateur de limiter la protection dutravailleur contre les mesures décidées par l'employeur à titre de représailles auseul licenciement, qui, tout en constituant une mesure d'une gravité particulière,n'en constitue pas pour autant la seule mesure pouvant efficacement dissuader untravailleur d'user de son droit à une protection juridictionnelle. Parmi de tellesmesures dissuasives figurent, notamment, celles qui, comme en l'espèce auprincipal, interviennent en réaction à une action introduite contre l'employeur etsont destinées à entraver les démarches du travailleur licencié dans sa recherched'un nouvel emploi.",
    "ECLI:EU:C:2001:134_94": "Aux points 23 à 25 de l'arrêt Sutton, précité, la Cour a d'ailleurs distingué les circonstances de l'affaire au principal dans cet arrêt de celles dans l'arrêt du 2 août 1993, Marshall, dit «Marshall II» (C-271/91, Rec. p. I-4367). Dans cette dernière affaire, concernant l'octroi d'intérêts sur des montants dus à titre de réparation du préjudice subi du fait d'un licenciement discriminatoire, la Cour a jugé qu'une réparation intégrale du préjudice subi ne saurait faire abstraction d'éléments, tels que l'écoulement du temps, susceptibles d'en réduire la valeur et que l'octroi d'intérêts est une composante indispensable d'un dédommagement permettant le rétablissement d'une égalité de traitement effective (arrêt Marshall II, précité, points 24 à 32). L'octroi d'intérêts avait en l'espèce été jugé comme étant une composante indispensable du dédommagement exigé par le droit communautaire en cas de licenciement discriminatoire.",
    "ECLI:EU:C:2001:214_18": "À cet égard, il convient de relever que constituent des mesures d'effet équivalent, interdites par l'article 28 CE, les obstacles à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises (telles que celles qui concernent leur dénomination, leur forme, leurs dimensions, leur poids, leur composition, leur présentation, leur étiquetage, leur conditionnement), même si ces règles sont indistinctement applicables à tous les produits, dès lors que cette application ne peut être justifiée par un but d'intérêt général de nature à primer les exigences de la libre circulation des marchandises (voir, notamment, arrêts du 20 février 1979, Rewe-Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, point 14, et du 9 février 1999, Van der Laan, C-383/97, Rec. p. I-731, point 19).",
    "ECLI:EU:C:2001:339_24": "Il convient de relever que constituent des mesures d'effet équivalent, interdites par l'article 30 du traité, les obstacles à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises (telles que celles concernant leur dénomination, leur forme, leurs dimensions, leur poids, leur composition, leur présentation, leur étiquetage, leur conditionnement), même si ces règles sont indistinctement applicables à tous les produits, dès lors que cette application ne peut être justifiée par un but d'intérêt général de nature à primer les exigences de la libre circulation des marchandises (voir, notamment, arrêts du 20 février 1979, Rewe-Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, point 14, et Houtwipper, précité, point 11).",
    "ECLI:EU:C:2002:343_72": "À cet égard, il convient de constater que, à supposer qu'une telle interprétation de ladite disposition nationale doive être retenue, l'obligation qu'elle comporte ne se réfère pas comme telle au produit ou à son emballage et, dès lors, ne concerne pas en soi une règle relative aux conditions auxquelles doivent répondre des marchandises, telles que celles qui concernent notamment leur étiquetage ou leur conditionnement (voir, notamment, arrêt du 5 avril 2001, Bellamy et English Shop Wholesale, C-123/00, Rec. p. I-2795, point 18).",
    "ECLI:EU:C:2002:34_37": "D'une part, il ressort d'une jurisprudence bien établie qu'un produit, légalement commercialisé dans un État membre, doit en principe pouvoir être commercialisé dans tout autre État membre, sans être soumis à des contrôles supplémentaires, sous réserve des exceptions prévues ou admises par le droit communautaire (voir, notamment, arrêts du 20 février 1979, Rewe-Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, point 14, et du 5 avril 2001, Bellamy et English Shop Wholesale, C-123/00, Rec. p. I-2795, point 18).",
    "ECLI:EU:C:2003:431_111": "Selon la jurisprudence de la Cour, il découle du principe de précaution que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir arrêts du 5 mai 1998, National Farmers' Union e.a., C-157/96, Rec. p. I-2211, point 63, et Royaume Uni/Commission, C-180/96, Rec. p. I-2265, point 99).",
    "ECLI:EU:C:2003:664_67": "Bien qu'une mesure n'ait pas pour objet de régler les échanges de marchandises entre les États membres, ce qui est déterminant c'est son effet, actuel ou potentiel, sur le commerce intracommunautaire. En application de ce critère, constituent des mesures d'effet équivalent, interdites par l'article 28 CE, les obstacles à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits, dès lors que cette application ne peut être justifiée par un but d'intérêt général de nature à primer les exigences de la libre circulation des marchandises (voir arrêt du 20 février 1979, Rewe-Zentral, dit \"Cassis de Dijon\", 120/78, Rec. p. 649, points 6, 14 et 15, ainsi que arrêts précités Keck et Mithouard, point 15, et Familiapress, point 8).",
    "ECLI:EU:C:2005:145_46": "Qu'elles soient adoptées par un État membre sur le fondement de l'article 10, paragraphe 1, de la directive 90/425 ou par la Commission sur le fondement de l'article 10, paragraphe 4, de cette même directive, des mesures conservatoires doivent respecter le principe de proportionnalité (voir, en ce sens, s'agissant de mesures adoptées par un État membre de destination, arrêt du 3 juillet 2003, Lennox, C-220/01, Rec. p. I-7091, point 76; s'agissant de mesures adoptées par la Commission, arrêts du 5 mai 1998, Royaume-Uni/Commission, C‑180/96, Rec. p. I‑2265, points 96 à 111, et Jippes, précité, point 113).",
    "ECLI:EU:C:2005:310_61": "Selon une jurisprudence constante, le principe de précaution présuppose que subsistent des incertitudes quant à l'existence ou à la portée de risques pour la santé des personnes (voir, en ce sens, arrêt du 9 septembre 2003, Monsanto Agricoltura Italia e.a., C-236/01, Rec. p. I‑8105, point 111 et la jurisprudence citée).",
    "ECLI:EU:C:2007:601_45": "Toutefois, l'objectif est de parvenir à une égalité de chances effective et ne saurait, dès lors, être atteint en l'absence de mesures propres à rétablir cette égalité lorsqu'elle n'est pas respectée. Ces mesures doivent donc assurer une protection juridictionnelle effective et efficace et avoir à l'égard de l'employeur un effet dissuasif réel (arrêt Marshall, précité, point 24).",
    "ECLI:EU:C:2008:160_41": "Les obstacles à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits, constituent des mesures d'effet équivalent à des restrictions quantitatives, interdites par l'article 28 CE (arrêts du 24 novembre 1993, Keck et Mithouard, C‑267/91 et C‑268/91, Rec. p. I‑6097, point 15; du 16 novembre 2000, Commission/Belgique, C‑217/99, Rec. p. I‑10251, point 16; du 7 juin 2007, Commission/Belgique, C‑254/05, Rec. p. I‑4269, point 28 et du 14 février 2008, Dynamic Medien, C‑244/06, non encore publié au Recueil, point 27). Il y a lieu de vérifier si les mesures litigieuses sont des réglementations constituant des mesures d'effet équivalent à des restrictions quantitatives à la libre circulation des marchandises au sens de la jurisprudence précitée.",
    "ECLI:EU:C:2008:728_57": "La Cour a reconnu au législateur communautaire, dans le cadre de l'exercice des compétences qui lui sont conférées, un large pouvoir d'appréciation lorsque son action implique des choix de nature politique, économique et sociale et lorsqu'il est appelé à effectuer des appréciations et des évaluations complexes (voir arrêt du 10 janvier 2006, IATA et ELFAA, C-344/04, Rec. p. I-403, point 80). En outre, lorsqu'il est appelé à restructurer ou à créer un système complexe, il lui est loisible de recourir à une approche par étapes (voir, en ce sens, arrêts du 29 février 1984, Rewe-Zentrale, 37/83, Rec. p. 1229, point 20; du 18 avril 1991, Assurances du crédit/Conseil et Commission, C-63/89, Rec. p. I-1799, point 11, ainsi que du 13 mai 1997, Allemagne/Parlement et Conseil, C-233/94, Rec. p. I-2405, point 43) et de procéder notamment en fonction de l'expérience acquise.",
    "ECLI:EU:C:2008:85_27": "Bien qu'une mesure n'ait pas pour objet de régler les échanges de marchandises entre les États membres, ce qui est déterminant c'est son effet, actuel ou potentiel, sur le commerce intracommunautaire. En application de ce critère, constituent des mesures d'effet équivalent les entraves à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations nationales, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises (telles que celles qui concernent leur dénomination, leur forme, leurs dimensions, leur poids, leur composition, leur présentation, leur étiquetage, leur conditionnement), même si ces règles sont indistinctement applicables à tous les produits, dès lors que cette application ne peut être justifiée par un but d'intérêt général de nature à primer les exigences de la libre circulation des marchandises (voir, en ce sens, arrêt du 20 février 1979, Rewe-Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, points 6, 14 et 15; du 26 juin 1997, Familiapress, C-368/95, Rec. p. I-3689, point 8, ainsi que du 11 décembre 2003, Deutscher Apothekerverband, C‑322/01, Rec. p. I‑14887, point 67).",
    "ECLI:EU:C:2008:85_28": "Dans sa jurisprudence, la Cour a également qualifié de mesures d'effet équivalent, interdites par l'article 28 CE, les dispositions nationales soumettant un produit, légalement fabriqué et commercialisé dans un autre État membre, à des contrôles supplémentaires, sous réserve des exceptions prévues ou admises par le droit communautaire (voir, notamment, arrêts du 22 janvier 2002, Canal Satélite Digital, C‑390/99, Rec. p. I-607, points 36 et 37, ainsi que du 8 mai 2003, ATRAL, C‑14/02, Rec. p. I-4431, point 65).",
    "ECLI:EU:C:2009:336_24": "Il convient de rappeler que doivent être considérées comme des « mesures d'effet équivalant à des restrictions quantitatives à l'importation » , au sens de l'article 28 CE, les mesures prises par un État membre ayant pour objet ou pour effet de traiter moins favorablement des produits en provenance d'autres États membres, ainsi que les entraves à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations nationales, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits (voir, en ce sens, arrêts du 20 février 1979 , Rewe-Zentral, dit « Cassis de Dijon » , 120/78, Rec. p. 649 , points 6, 14 et 15; du , Familiapress, C-368/95, Rec. p. I-3689 , point 8, ainsi que du , Deutscher Apothekerverband, C-322/01, Rec. p. I-14887 , point 67). Relève également de la même notion toute autre mesure qui entrave l'accès au marché d'un État membre des produits originaires d'autres États membres (voir arrêt du , Commission/Italie, C-110/05, non encore publié au Recueil, point 37).",
    "ECLI:EU:C:2009:66_34": "Il ressort d'une jurisprudence également constante que l'article 28 CE reflète l'obligation de respecter les principes de non-discrimination et de reconnaissance mutuelle des produits légalement fabriqués et commercialisés dans d'autres États membres, ainsi que celle d'assurer aux produits communautaires un libre accès aux marchés nationaux (voir, en ce sens, arrêts du 14 juillet 1983, Sandoz, 174/82, Rec. p. 2445, point 26; du 20 février 1979, Rewe-Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, points 6, 14 et 15, ainsi que Keck et Mithouard, précité, points 16 et 17).",
    "ECLI:EU:C:2009:66_35": "Ainsi, constituent des mesures d'effet équivalent à des restrictions quantitatives les entraves à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations nationales, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits (voir, en ce sens, arrêts Cassis de Dijon, précité, points 6, 14 et 15; du 26 juin 1997, Familiapress, C-368/95, Rec. p. I-3689, point 8, ainsi que du 11 décembre 2003, Deutscher Apothekerverband, C-322/01, Rec. p. I-14887, point 67).",
    "ECLI:EU:C:2010:609_66": "En outre, ainsi que la Commission l'a fait valoir à juste titre, le droit fondamental à une protection juridictionnelle effective, garanti par l'article 47 de la charte des droits fondamentaux de l'Union européenne, laquelle a, selon l'article 6, paragraphe 1, premier alinéa, TUE, «la même valeur juridique que les traités», serait substantiellement affecté si un employeur, en réaction à une plainte ou à une action en justice engagée par un travailleur en vue d'assurer le respect des dispositions d'une directive visant à protéger sa sécurité et sa santé, était en droit de prendre une mesure telle que celle en cause au principal. En effet, la crainte de pareille mesure de rétorsion contre laquelle aucun recours juridictionnel ne serait ouvert risquerait de dissuader les travailleurs s'estimant lésés par une mesure prise par leur employeur de faire valoir leurs droits par voie juridictionnelle et, partant, serait de nature à compromettre gravement la réalisation de l'objectif poursuivi par la directive (voir, par analogie, arrêt du 22 septembre 1998, Coote, C‑185/97, Rec. p. I‑5199, points 24 et 27).",
    "ECLI:EU:C:2010:725_48": "Il ressort d'une jurisprudence également constante que l'article 34 TFUE reflète l'obligation de respecter les principes de non-discrimination et de reconnaissance mutuelle des produits légalement fabriqués et commercialisés dans d'autres États membres ainsi que celle d'assurer aux produits de l'Union un libre accès aux marchés nationaux (voir arrêt Commission/Italie, précité, point 34 et jurisprudence citée).",
    "ECLI:EU:C:2010:725_49": "Ainsi, doivent être considérées comme des mesures d'effet équivalent à des restrictions quantitatives les mesures prises par un État membre qui ont pour objet ou pour effet de traiter moins favorablement des produits en provenance d'autres États membres, de même que des règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits (voir arrêt Commission/Italie, précité, points 35 et 37).",
    "ECLI:EU:C:2010:803_73": "Il découle du principe de précaution que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir arrêts National Farmers' Union e.a., précité, point 63; Royaume-Uni/Commission, précité, point 99, ainsi que du 9 septembre 2003, Monsanto Agricoltura Italia e.a., C‑236/01, Rec. p. I‑8105, point 111).",
    "ECLI:EU:C:2011:414_69": "Si cette juridiction concluait que tel était le cas, et donc que la réglementation nationale temporaire peut, en principe, être qualifiée de mesure conservatoire conforme à l'article 10, paragraphe 1, quatrième alinéa, de la directive 90/425, il lui incomberait encore de vérifier que le principe de proportionnalité a été respecté (voir, en ce sens, arrêt du 10 mars 2005, Tempelman et van Schaijk, C-96/03 et C‑97/03, Rec. p. I‑1895, point 46 et jurisprudence citée).",
    "ECLI:EU:C:2011:641_27": "De plus, doivent être considérées comme des «mesures d'effet équivalent à des restrictions quantitatives à l'importation», au sens de l'article 34 TFUE, les mesures prises par un État membre ayant pour objet ou pour effet de traiter moins favorablement des produits en provenance d'autres États membres, ainsi que les entraves à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations nationales, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et/ou commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits (voir, en ce sens, arrêt Deutscher Apothekerverband, précité, point 67).",
    "ECLI:EU:C:2012:113_53": "Il ressort d'une jurisprudence également constante que l'article 34 TFUE reflète l'obligation de respecter les principes de non-discrimination et de reconnaissance mutuelle des produits légalement fabriqués et commercialisés dans d'autres États membres ainsi que celle d'assurer aux produits de l'Union un libre accès aux marchés nationaux (voir arrêts du 10 février 2009, Commission/Italie, C-110/05, Rec. p. I-519, point 34, ainsi que Ker-Optika, précité, point 48).",
    "ECLI:EU:C:2012:241_33": "Il ressort d'une jurisprudence également constante que l'article 34 TFUE reflète l'obligation de respecter les principes de non-discrimination et de reconnaissance mutuelle des produits légalement fabriqués et commercialisés dans d'autres États membres ainsi que celle visant à assurer aux produits de l'Union un libre accès aux marchés nationaux (voir arrêts Commission/Italie, précité, point 34, et du 2 décembre 2010, Ker-Optika, C-108/09, Rec. p. I-12213, point 48).",
    "ECLI:EU:C:2012:241_34": "Ainsi, doivent être considérées comme des mesures d'effet équivalent à des restrictions quantitatives les mesures prises par un État membre ayant pour objet ou pour effet de traiter moins favorablement des marchandises en provenance d'autres États membres, de même que des règles relatives aux conditions auxquelles doivent répondre ces dernières, même si de telles règles sont indistinctement applicables à tous les produits (voir arrêts précités Commission/Italie, points 35 et 37, ainsi que Ker-Optika, point 49).",
    "ECLI:EU:C:2012:3806_23": "",
    "ECLI:EU:C:2013:275_63": "Il s'ensuit que le régime de sanctions mis en place en vue de transposer l'article 17 de la directive 2000/78 dans l'ordre juridique d'un État membre doit notamment assurer, parallèlement aux mesures prises pour mettre en œuvre l'article 9 de la même directive, une protection juridique effective et efficace des droits tirés de celle-ci (voir par analogie, notamment, arrêt du 22 avril 1997, Draehmpaehl, C-180/95, Rec. p. I-2195, points 24, 39 et 40). La rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif (voir en ce sens, notamment, arrêts du 8 juin 1994, Commission/Royaume-Uni, C-383/92, Rec. p. I-2479, point 42, ainsi que Draehmpaehl, précité, point 40), tout en respectant le principe général de proportionnalité (voir, en ce sens, arrêts du 6 novembre 2003, Lindqvist, C-101/01, Rec. p. I-12971, points 87 et 88, ainsi que du 5 juillet 2007, Ntionik et Pikoulas, C-430/05, Rec. p. I-5835, point 53).",
    "ECLI:EU:C:2013:588_51": "La Cour a notamment jugé que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (voir, par analogie, arrêt du 25 avril 2013, Asociația Accept, C‑81/12, point 63 et jurisprudence citée).",
    "ECLI:EU:C:2014:172_57": "À la lumière de la jurisprudence constante de la Cour, la réglementation litigieuse constitue une mesure d'effet équivalant à des restrictions quantitatives à l'importation, interdite par l'article 34 TFUE, dans la mesure où elle a pour effet d'entraver l'accès au marché lituanien des véhicules équipés d'un poste de conduite à droite, qui sont légalement produits et immatriculés dans des États membres autres que la République de Lituanie (voir, concernant les origines de cette jurisprudence, arrêts du 11 juillet 1974, Dassonville, 8/74, Rec. p. 837, point 5; du 20 février 1979, Rewe-Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, point 14, ainsi que, plus récemment, du 10 février 2009, Commission/Italie, C-110/05, Rec. p. I-519, point 58).",
    "ECLI:EU:C:2014:173_52": "À la lumière de la jurisprudence constante de la Cour, la réglementation litigieuse constitue une mesure d'effet équivalant à des restrictions quantitatives à l'importation, interdite par l'article 34 TFUE, dans la mesure où elle a pour effet d'entraver l'accès au marché polonais des véhicules équipés d'un poste de conduite à droite, qui sont légalement produits et immatriculés dans des États membres autres que la République de Pologne (voir, concernant les origines de cette jurisprudence, arrêts du 11 juillet 1974, Dassonville, 8/74, Rec. p. 837, point 5; du 20 février 1979, Rewe‑Zentral, dit «Cassis de Dijon», 120/78, Rec. p. 649, point 14, ainsi que, plus récemment, du 10 février 2009, Commission/Italie, C-110/05, Rec. p. I-519, point 58).",
    "ECLI:EU:C:2014:190_45": "La Cour a notamment jugé que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (arrêt Texdata Software, précité, point 51).",
    "ECLI:EU:C:2014:255_57": "Ensuite, en ce qui concerne le reproche tenant à la méconnaissance, par le Tribunal, du principe de précaution, il importe de rappeler que conformément à ce principe, tel qu'interprété par la jurisprudence de la Cour, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir arrêt du9 septembre 2003, Monsanto Agricoltura Italia e.a., C-236/01, Rec. p. I-8105, point 111, ainsi que, en ce sens, arrêts du 26 mai 2005, Codacons et Federconsumatori, C-132/03, Rec. p. I-4167, point 61, et du 12 janvier 2006, Agrarproduktion Staebelow, C-504/04, Rec. p. I-679, point 39).",
    "ECLI:EU:C:2014:350_65": "En outre, le groupe de travail «Vision» note, dans son rapport, une pénurie d'études scientifiques concernant plusieurs aspects de vision des conducteurs de véhicules à moteur. À cet égard, il convient de rappeler également la jurisprudence de la Cour selon laquelle, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, le législateur de l'Union peut prendre des mesures de protection sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir, en ce sens, arrêts Royaume-Uni/Commission, C‑180/96, EU:C:1998:192, point 99; Commission/Danemark, C‑192/01, EU:C:2003:492, point 49, ainsi que Gowan Comércio Internacional e Serviços, C‑77/09, EU:C:2010:803, point 73).",
    "ECLI:EU:C:2015:475_23": "Dans ce contexte, la Cour a précisé que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (voir arrêts Asociația Accept, C‑81/12, EU:C:2013:275, point 63, et LCL Le Crédit Lyonnais, C‑565/12, EU:C:2014:190, point 45).",
    "ECLI:EU:C:2015:796_21": "Conformément au principe de précaution, tel qu'interprété par la Cour, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (arrêt Monsanto Agricoltura Italia e.a., C‑236/01, EU:C:2003:431, point 111, ainsi que, en ce sens, arrêts Codacons et Federconsumatori, C‑132/03, EU:C:2005:310, point 61, et Agrarproduktion Staebelow, C‑504/04, EU:C:2006:30, point 39).",
    "ECLI:EU:C:2015:823_81": "Ainsi que l'a relevé M. l'avocat général au point 49 de ses conclusions, le législateur de l'Union doit tenir compte du principe de précaution conformément auquel, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir arrêt Acino/Commission, C‑269/13 P, EU:C:2014:255, point 57).",
    "ECLI:EU:C:2015:831_31": "Toutefois, les mesures propres à rétablir l'égalité des chances effective doivent assurer une protection juridictionnelle effective et efficace et avoir à l'égard de l'employeur un effet dissuasif réel (voir arrêts von Colson et Kamann, 14/83, EU:C:1984:153, point 23 et 24; Draehmpaehl, C‑180/95, EU:C:1997:208, point 25, ainsi que Paquay, C‑460/06, EU:C:2007:601, point 45).",
    "ECLI:EU:C:2016:324_55": "Dans de telles circonstances, le législateur de l'Union devait tenir compte du principe de précaution, selon lequel, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour la santé publique persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (arrêt Neptune Distribution, C‑157/14, EU:C:2015:823, points 81 et 82).",
    "ECLI:EU:C:2016:428_47": "Par ailleurs, il y a lieu de rappeler que le législateur de l'Union doit tenir compte du principe de précaution, conformément auquel, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour la santé publique persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (voir, notamment, arrêt du 17 décembre 2015, Neptune Distribution, C‑157/14, EU:C:2015:823, points 81 et 82).",
    "ECLI:EU:C:2016:704_34": "Ainsi, constituent des mesures d'effet équivalent à des restrictions quantitatives les entraves à la libre circulation des marchandises résultant, en l'absence d'harmonisation des législations nationales, de l'application à des marchandises en provenance d'autres États membres, où elles sont légalement fabriquées et commercialisées, de règles relatives aux conditions auxquelles doivent répondre ces marchandises, même si ces règles sont indistinctement applicables à tous les produits (voir, en ce sens, arrêt du 20 février 1979, Rewe-Zentral, dit Cassis de Dijon , 120/78, EU:C:1979:42, points 6, 14 et 15).",
    "ECLI:EU:C:2016:777_40": "La Cour a jugé, dans ce contexte, que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (arrêt du 27 mars 2014, LCL Le Crédit Lyonnais, C‑565/12, EU:C:2014:190, point 45).",
    "ECLI:EU:C:2016:842_63": "La Cour a déjà jugé que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (voir arrêt du 27 mars 2014, LCL Le Crédit Lyonnais,C‑565/12, EU:C:2014:190, point 45 et jurisprudence citée).",
    "ECLI:EU:C:2017:229_42": "La Cour a jugé, dans ce contexte, que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (arrêt du 19 octobre 2016, EL‑EM-2001, C‑501/14, EU:C:2016:777, point 40).",
    "ECLI:EU:C:2017:513_59": "En effet, tout d'abord, il importe de rappeler que le législateur de l'Union dispose d'un large pouvoir d'appréciation quant aux questions d'ordre médical complexes, telles que celle de savoir si les capacités physiques particulières requises pour l'exercice de la profession de pilote de ligne ne se rencontrent pas chez les personnes au-delà d'un certain âge, et que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, ledit législateur peut prendre des mesures de protection sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir, par analogie, arrêt du 22 mai 2014, Glatzel, C‑356/12, EU:C:2014:350, points 64 et 65).",
    "ECLI:EU:C:2018:357_42": "Dans ce contexte, la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment (voir, par analogie, arrêt du 16 juillet 2015, Chmielewski, C‑255/14, EU:C:2015:475, point 23).",
    "ECLI:EU:C:2018:483_112": "Par ailleurs, en ce qui concerne l'invocation du principe de protection de la confiance légitime en raison de l'action du législateur de l'Union, il convient de rappeler que la Cour a reconnu audit législateur un large pouvoir d'appréciation lorsque son action implique des choix de nature politique, économique et sociale et lorsqu'il est appelé à effectuer des appréciations et des évaluations complexes (arrêt du 16 décembre 2008, Arcelor Atlantique et Lorraine e.a., C‑127/07, EU:C:2008:728, point 57).",
    "ECLI:EU:C:2018:483_125": "Tout d'abord, ainsi qu'il a été rappelé au point 112 du présent arrêt, le SEQE est un système complexe, dans le cadre duquel la Cour a reconnu au législateur de l'Union la faculté de recourir à une approche par étapes et de procéder en fonction de l'expérience acquise, lorsqu'il est appelé à le restructurer (voir, en ce sens, arrêt du 16 décembre 2008, Arcelor Atlantique et Lorraine e.a., C‑127/07, EU:C:2008:728, point 57).",
    "ECLI:EU:C:2018:938_38": "En outre, le législateur de l'Union doit tenir compte du principe de précaution, conformément auquel, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour la santé publique persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (arrêt du 9 juin 2016, Pesce e.a., C‑78/16 et C‑79/16, EU:C:2016:428, point 47 ainsi que jurisprudence citée).",
    "ECLI:EU:C:2019:1103_35": "S'agissant du caractère nécessaire d'une telle réglementation en vue de la réalisation des objectifs poursuivis, il convient de rappeler que la rigueur de la sanction imposée doit être en adéquation avec la gravité de l'infraction qu'elle vise à sanctionner. En outre, les mesures administratives ou répressives permises par une législation nationale ne doivent pas excéder les limites de ce qui est nécessaire à la réalisation des objectifs légitimement poursuivis par cette législation (arrêt du 12 septembre 2019, Maksimovic e.a., C‑64/18, C‑140/18, C‑146/18 et C‑148/18, EU:C:2019:723, point 39).",
    "ECLI:EU:C:2019:1108_33": "S'agissant du caractère nécessaire d'une telle réglementation en vue de la réalisation des objectifs poursuivis, il convient de rappeler que la rigueur de la sanction imposée doit être en adéquation avec la gravité de l'infraction qu'elle vise à sanctionner. En outre, les mesures administratives ou répressives permises par une législation nationale ne doivent pas excéder les limites de ce qui est nécessaire à la réalisation des objectifs légitimement poursuivis par cette législation (arrêt du 12 septembre 2019, Maksimovic e.a., C‑64/18, C‑140/18, C‑146/18 et C‑148/18, EU:C:2019:723, point 39).",
    "ECLI:EU:C:2019:472_26": "Concernant, deuxièmement, le pouvoir d'appréciation du législateur de l'Union et le principe général d'égalité de traitement, selon une jurisprudence constante de la Cour, celle-ci a reconnu au législateur de l'Union, dans le cadre de l'exercice des compétences qui lui sont conférées, un large pouvoir d'appréciation lorsque son action implique des choix de nature politique, économique et sociale et lorsqu'il est appelé à effectuer des appréciations et des évaluations complexes (arrêts du 16 décembre 2008, Arcelor Atlantique et Lorraine e.a., C‑127/07, EU:C:2008:728, point 57, ainsi que du 30 janvier 2019, Planta Tabak, C‑220/17, EU:C:2019:76, point 44). Seul le caractère manifestement inapproprié d'une mesure arrêtée en ce domaine, par rapport à l'objectif que les institutions compétentes entendent poursuivre, peut affecter la légalité d'une telle mesure (arrêt du 14 décembre 2004, Swedish Match, C‑210/03, EU:C:2004:802, point 48).",
    "ECLI:EU:C:2019:723_39": "À cet égard, s'agissant de la nécessité d'une restriction à la libre prestation des services telle que celle en cause au principal, il convient de rappeler que la rigueur de la sanction imposée doit être en adéquation avec la gravité de l'infraction qu'elle vise à sanctionner. En outre, les mesures administratives ou répressives permises par une législation nationale ne doivent pas excéder les limites de ce qui est nécessaire à la réalisation des objectifs légitimement poursuivis par cette législation (voir, par analogie, arrêt du 31 mai 2018, Zheng, C‑190/17, EU:C:2018:357, points 41 et 42 ainsi que jurisprudence citée).",
    "ECLI:EU:C:2019:76_44": "À cet égard, la Cour a reconnu au législateur de l'Union, dans le cadre de l'exercice des compétences qui lui sont conférées, un large pouvoir d'appréciation lorsque son action implique des choix de nature politique, économique et sociale et lorsqu'il est appelé à effectuer des appréciations et des évaluations complexes (arrêt du 16 décembre 2008, Arcelor Atlantique et Lorraine e.a., C‑127/07, EU:C:2008:728, point 57). Le législateur de l'Union pourrait donc, dans l'exercice de son large pouvoir d'appréciation, ne procéder à une harmonisation que par étapes et n'exiger qu'une suppression progressive des mesures unilatérales prises par les États membres (voir, en ce sens, arrêt du 4 mai 2016, Philip Morris Brands e.a., C‑547/14, EU:C:2016:325, points 63 et 134).",
    "ECLI:EU:C:2019:800_43": "Ce principe implique que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour la santé publique persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (voir, en ce sens, arrêts du 22 décembre 2010, Gowan Comércio Internacional e Serviços, C‑77/09, EU:C:2010:803, points 73 et 76 ; du 17 décembre 2015, Neptune Distribution, C‑157/14, EU:C:2015:823, points 81 et 82, ainsi que du 22 novembre 2018, Swedish Match, C‑151/17, EU:C:2018:938, point 38).",
    "ECLI:EU:C:2020:167_26": "En outre, la Cour a jugé que la rigueur des sanctions doit être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (arrêt du 9 novembre 2016, Home Credit Slovakia, C‑42/15, EU:C:2016:842, point 63 et jurisprudence citée).",
    "ECLI:EU:C:2021:1035_73": "En outre, la Cour a jugé que la rigueur des sanctions devait être en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en respectant le principe général de proportionnalité (arrêt du 5 mars 2020, OPR-Finance, C‑679/18, EU:C:2020:167, point 26).",
    "ECLI:EU:C:2021:367_80": "Or, le principe de précaution implique que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques, notamment pour l'environnement, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour l'environnement persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (voir, en ce sens, arrêt du 1er octobre 2019, Blaise e.a., C‑616/17, EU:C:2019:800, point 43 ainsi que jurisprudence citée).",
    "ECLI:EU:C:2021:479_36": "Ainsi, il résulte de la jurisprudence de la Cour que, si l'article 23 de la directive 2008/48 exige que les sanctions soient dissuasives, les tribunaux doivent également jouir d'un pouvoir d'appréciation leur permettant de choisir, selon les circonstances de l'espèce, la mesure proportionnée à la gravité du non-respect de l'obligation constatée (voir, en ce sens, arrêts du 9 novembre 2016, Home Credit Slovakia, C‑42/15, EU:C:2016:842, point 63, et du 5 mars 2020, OPR-Finance, C‑679/18, EU:C:2020:167, point 26). Les juridictions nationales doivent donc prendre en considération l'ensemble des règles du droit national et les interpréter, dans toute la mesure possible, à la lumière du libellé et de la finalité de cette directive, afin d'obtenir un résultat compatible avec les objectifs qu'elle poursuit (voir, en ce sens, arrêts du 27 mars 2014, LCL Le Crédit Lyonnais, C‑565/12, EU:C:2014:190, point 54, et du 5 mars 2020, OPR-Finance, C‑679/18, EU:C:2020:167, point 41).",
    "ECLI:EU:C:2021:845_45": "Encore faut-il, troisièmement, que la rigueur des sanctions imposées soit en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en n'allant pas au-delà de ce qui est nécessaire pour atteindre ledit objectif (voir, en ce sens, arrêt du 5 mars 2020, OPR-Finance, C‑679/18, EU:C:2020:167, point 26 et jurisprudence citée), une telle exigence découlant notamment du principe de proportionnalité des peines inscrit à l'article 49, paragraphe 3, de la Charte (voir, en ce sens, arrêt du 20 mars 2018, Menci, C‑524/15, EU:C:2018:197, point 55).",
    "ECLI:EU:C:2022:101_44": "Par analogie, et compte tenu également du large pouvoir d'appréciation dont dispose le législateur de l'Union dans le cadre de l'exercice des compétences qui lui sont conférées lorsque son action implique des choix de nature politique, économique et sociale et lorsqu'il est appelé à effectuer des appréciations et des évaluations complexes (arrêt du 30 janvier 2019, Planta Tabak, C‑220/17, EU:C:2019:76, point 44), il est loisible à ce législateur de renvoyer, dans les actes qu'il adopte, à des normes techniques établies par un organisme de normalisation, tel que l'Organisation internationale de normalisation (ISO).",
    "ECLI:EU:C:2022:111_34": "S'agissant, en quatrième et dernier lieu, de l'applicabilité du principe de précaution en l'occurrence, il convient de rappeler que ce principe implique que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées (voir, en ce sens, arrêt du 6 mai 2021, Bayer CropScience et Bayer/Commission, C‑499/18 P, EU:C:2021:367, point 80). À cet égard, il suffit de relever, d'une part, qu'aucune des parties à la procédure ne nie les risques liés à la consommation des produits de tabac à fumer et, d'autre part, qu'il ressort du préambule de la CCLAT que des données scientifiques ont établi de manière irréfutable que la consommation de tabac et l'exposition à la fumée du tabac sont cause de décès, de maladie et d'incapacité, et qu'il existe un décalage entre l'exposition à la cigarette et l'utilisation d'autres produits du tabac et l'apparition des maladies liées au tabac. En conséquence, ainsi que M. l'avocat général l'a relevé au point 65 de ses conclusions, ce principe ne s'applique pas à la situation en cause au principal.",
    "ECLI:EU:C:2022:336_36": "Encore faut-il, troisièmement, que la rigueur des sanctions imposées soit en adéquation avec la gravité des violations qu'elles répriment, notamment en assurant un effet réellement dissuasif, tout en n'allant pas au-delà de ce qui est nécessaire pour atteindre ledit objectif, une telle exigence découlant notamment du principe de proportionnalité des peines inscrit à l'article 49, paragraphe 3, de la Charte [arrêt du 14 octobre 2021, Landespolizeidirektion Steiermark (Machines à sous), C‑231/20, EU:C:2021:845, point 45 et jurisprudence citée].",
    "ECLI:EU:C:2022:470_96": "Le principe de précaution implique que, lorsque des incertitudes subsistent quant à l'existence ou à la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour la santé publique persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (arrêt du 1er octobre 2019, Blaise e.a., C‑616/17, EU:C:2019:800, point 43 et jurisprudence citée).",
    "ECLI:EU:C:2022:87_21": "Par ailleurs, la Cour a également jugé, s'agissant du contrôle juridictionnel du respect du principe d'égalité de traitement par le législateur de l'Union, que ce dernier dispose, dans le cadre de l'exercice des compétences qui lui sont conférées, d'un large pouvoir d'appréciation lorsqu'il intervient dans un domaine impliquant des choix de nature politique, économique et sociale et lorsqu'il est appelé à effectuer des appréciations et des évaluations complexes. Ainsi, seul le caractère manifestement inapproprié d'une mesure arrêtée en ce domaine, par rapport à l'objectif que les institutions compétentes entendent poursuivre, peut affecter la légalité d'une telle mesure (voir, notamment, arrêt du 6 juin 2019, P. M. e.a., C‑264/18, EU:C:2019:472, point 26).",
    "ECLI:EU:C:2023:180_116": "Selon la requérante, il ressort de l'arrêt du 1er octobre 2019, Blaise e.a. (C‑616/17, EU:C:2019:800, points 43 ainsi que 46), que le principe de précaution n'autorise l'adoption de mesures de protection que lorsqu'il subsiste des incertitudes sur l'existence ou la portée de risques. En revanche, ce principe ne signifierait pas que les agences de l'Union peuvent adopter des mesures sur la base de données scientifiques non fiables.",
    "ECLI:EU:C:2023:180_127": "Il y a lieu, en outre, de rappeler que le principe de précaution implique que, lorsque des incertitudes subsistent quant à l'existence ou la portée de risques pour la santé des personnes, des mesures de protection peuvent être prises sans avoir à attendre que la réalité et la gravité de ces risques soient pleinement démontrées. Lorsqu'il s'avère impossible de déterminer avec certitude l'existence ou la portée du risque allégué, en raison de la nature non concluante des résultats des études menées, mais que la probabilité d'un dommage réel pour la santé publique persiste dans l'hypothèse où le risque se réaliserait, le principe de précaution justifie l'adoption de mesures restrictives (arrêt du 16 juin 2022, SGL Carbon e.a./Commission, C‑65/21 P et C‑73/21 P à C‑75/21 P, EU:C:2022:470, point 96 ainsi que jurisprudence citée).",
    "ECLI:EU:C:2023:367_51": "S'agissant des mesures administratives ou répressives permises par une législation nationale, celles-ci ne doivent pas excéder les limites de ce qui est approprié et nécessaire à la réalisation des objectifs légitimement poursuivis par cette législation (arrêt du 24 février 2022, Agenzia delle dogane e dei monopoli et Ministero dell'Economia e delle Finanze, C‑452/20, EU:C:2022:111, point 37 ainsi que jurisprudence citée). En particulier, la rigueur de la sanction imposée doit être en adéquation avec la gravité de la violation qu'elle vise à réprimer (arrêt du 12 septembre 2019, Maksimovic e.a., C‑64/18, C‑140/18, C‑146/18 et C‑148/18, EU:C:2019:723, point 39 ainsi que jurisprudence citée).",
    "ECLI:EU:C:2023:64_86": "D'autre part, la Cour a considéré, aux fins d'apporter des précisions visant à guider les juridictions nationales dans une telle appréciation, que la sanction de la nullité du contrat satisfait, en principe, aux exigences d'effectivité, de proportionnalité et de dissuasion posées par une disposition analogue à l'article 13 de la directive 2005/29 (voir, en ce sens, arrêt du 5 mars 2020, OPR-Finance, C‑679/18, EU:C:2020:167, points 25, 26, 29 et 30 ainsi que jurisprudence citée).",
    "ECLI:EU:C:2023:665_49": "Une telle obligation implique que les mesures en question soient suffisamment efficaces pour atteindre l'objectif poursuivi par la directive 79/7 consistant à parvenir à une égalité de chances effective, de telle sorte que celles-ci doivent être propres à rétablir cette égalité, assurer une protection juridictionnelle effective et efficace et avoir à l'égard de l'organisme ayant commis la discrimination un effet dissuasif réel (voir, en ce qui concerne les conditions de travail et notamment celles relatives au licenciement, arrêts du 2 août 1993, Marshall, C‑271/91, EU:C:1993:335, points 22 et 24, ainsi que du 17 décembre 2015, Arjona Camacho, C‑407/14, EU:C:2015:831, points 29 et 31).",
}